#1
# for loop ეს არის ციკლი რომელსაც ვიყენებთ როცა გვინდა ერთი და იგივე კოდის გაგზავნა 
# მისი დანიშნულებაა  გაგვიმარტივოს კოდი და ვიყეებთ როცა რაღაცისს გამეორება 
# მაგ
for i in range(1,6):
    print(i)

# 2

# wile loop არის განმეორებით ციკლი რომელიც იმეორებს იქამდე სანამ სიმართლეა 
#  მისი დანიშნულებაა  კოდის გაეორება როცა იქნება მცდარი 

x = 1
while x <= 5:
    print(x)
    x += 1

# 3
#  იდენტაცია არის ხაზის დასაწყისში სიცარიელე და მის აკეტება tab ის ან space ით შეგვიძლია 
# მისი დანიშნულებაა პიტონში syntax ის დაცვა ანუ მაგალითდ ზემოთ კდში range(1,6) ის შემდეგ print ის წინ გვაქვს იდენტაცია 
# ხოლო html ში კომფორტისთვის 

# 4
# %   მას ვიყეებთ იმისთვის რომ   რიცხვების ნაშტი ვიპოვოთ მაგალითდ კენტის 1 იქნება და ლუჭის 0

#5

for i in range(0,50,2):
    print(i)

# 6

for i in range(10,):
    print("nika")

# 7

i = 1
while i <= 67:
    if i > 3:
        print(i)
    i += 1 

# 8

m = 0 

while m < 10:
    print("nika")

    m+=1 

# 9)
my_favorite = 100
user_num = int(input("შეიყვანეთ რიცხვი: "))

while user_num < my_favorite:
    print("შეიყვანე უფრო დიდი რიცხვი")
    user_num = int(input("შეიყვანეთ რიცხვი კიდევ ერთხელ: "))